# GetTransparency Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ColorWithTransparency..::..GetTransparency Method
ColorWithTransparency Class See Also
---
get transparency
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public uint GetTransparency()
```

Visual Basic
---
```text
Public Function GetTransparency As UInteger
```

Visual C++
---
```text
public:
unsigned int GetTransparency()
```

# ### Return Value
transparency
# See Also
ColorWithTransparency Class
Autodesk.Revit.DB Namespace